In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.DataFrame(np.arange(0,20).reshape(4,5),index=['Row1','Row2','Row3','Row4'],columns=['column1','column2','column3','colomn4','column5'])

In [3]:
df.head()

      column1  column2  column3  colomn4  column5
Row1        0        1        2        3        4
Row2        5        6        7        8        9
Row3       10       11       12       13       14
Row4       15       16       17       18       19

In [4]:
df[['column2','column3']]

      column2  column3
Row1        1        2
Row2        6        7
Row3       11       12
Row4       16       17

In [5]:
df.iloc[0:,0:2]

      column1  column2
Row1        0        1
Row2        5        6
Row3       10       11
Row4       15       16

In [6]:
df['column2'].value_counts()

1     1
6     1
11    1
16    1
Name: column2, dtype: int64

## csv

In [7]:
df = pd.read_csv('test1.csv')

In [8]:
df.head()

  Unnamed: 0  column1  column2  column3  column4
0       Row1        0        1        2        3
1       Row2        4        5        6        7
2       Row3        8        9       10       11
3       Row4       12       13       14       15
4       Row5       16       17       18       19

In [9]:
df = pd.read_csv('test2.csv',sep=';')

In [10]:
df.head()

  Unnamed: 0  column1  column2  column3  column4
0       Row1        0        1        2        3
1       Row2        4        5        6        7
2       Row3        8        9       10       11
3       Row4       12       13       14       15
4       Row5       16       17       18       19

In [11]:
data = ('a,b,c\n'
          '1,2,3\n'
          '3,5,6')

In [12]:
print(data)

a,b,c
1,2,3
3,5,6

In [13]:
from io import StringIO,BytesIO

In [14]:
df = pd.read_csv(StringIO(data))

In [15]:
df

   a  b  c
0  1  2  3
1  3  5  6

In [16]:
StringIO()

### usecols,dtype,index_col

In [17]:
data=('index,col1,col2,col3\n'
            '1,cow,milk,white\n'
            '2,bat,corona,black\n'
            '3,mosquito,dengue,grey')

In [18]:
print(data)

index,col1,col2,col3
1,cow,milk,white
2,bat,corona,black
3,mosquito,dengue,grey

In [19]:
df=pd.read_csv(StringIO(data),index_col=0,usecols=['index','col1','col3'])

In [20]:
df

           col1   col3
index
1           cow  white
2           bat  black
3      mosquito   grey

In [21]:
data=('index,a,b,c\n'
       '1,45,65,3\n'
       '2,56,7,4')

In [22]:
df=pd.read_csv(StringIO(data),index_col=0,dtype={'index':int,'a':'Int64','b':float})

In [23]:
df

        a     b  c
index
1      45  65.0  3
2      56   7.0  4

In [24]:
df.dtypes

a      Int64
b    float64
c      int64
dtype: object

In [25]:
dataf=pd.DataFrame(np.arange(0,20).reshape(5,4),index=['Row1','Row2','Row3','Row4','Row5'],columns=['col1','col2','col3','col4'])

In [26]:
dataf.head(2)

      col1  col2  col3  col4
Row1     0     1     2     3
Row2     4     5     6     7

In [27]:
dataf.tail(3)

      col1  col2  col3  col4
Row3     8     9    10    11
Row4    12    13    14    15
Row5    16    17    18    19

In [28]:
dataf.to_csv('Revision.csv')

In [29]:
df = pd.read_csv('Revision.csv')

In [30]:
df

  Unnamed: 0  col1  col2  col3  col4
0       Row1     0     1     2     3
1       Row2     4     5     6     7
2       Row3     8     9    10    11
3       Row4    12    13    14    15
4       Row5    16    17    18    19

In [31]:
df['col1']

0     0
1     4
2     8
3    12
4    16
Name: col1, dtype: int64

In [32]:
df.iloc[1:,2:]

   col2  col3  col4
1     5     6     7
2     9    10    11
3    13    14    15
4    17    18    19

In [33]:
df=pd.read_csv('Revision.csv',index_col=0)

In [34]:
df

      col1  col2  col3  col4
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row5    16    17    18    19

In [35]:
df['col1'][3]

12

## Series

In [40]:
ser = pd.Series(np.random.rand(34))

In [44]:
ser[10]

0.4392558688896918

In [41]:
type(ser)

pandas.core.series.Series

## DataFrame

In [56]:
newdf = pd.DataFrame(np.random.rand(334,5), index=np.arange(334))

In [58]:
newdf.head()

          0         1         2         3         4
0  0.233102  0.039564  0.356380  0.889741  0.014918
1  0.526708  0.343950  0.147560  0.281319  0.984535
2  0.198042  0.062252  0.010509  0.036467  0.415730
3  0.187102  0.072202  0.444231  0.109172  0.648923
4  0.930176  0.149132  0.321399  0.982759  0.729356

In [50]:
newdf

            0         1         2         3         4
0    0.444552  0.858980  0.001131  0.123647  0.974580
1    0.872332  0.957939  0.798554  0.106214  0.891021
2    0.669778  0.004120  0.069014  0.873231  0.918203
3    0.991291  0.792216  0.964747  0.447572  0.926351
4    0.698803  0.780351  0.607302  0.200728  0.646935
..        ...       ...       ...       ...       ...
329  0.449918  0.834906  0.777672  0.122510  0.232083
330  0.141551  0.173164  0.398670  0.494899  0.116440
331  0.646492  0.065836  0.656268  0.994861  0.924804
332  0.924972  0.639133  0.544220  0.523469  0.254930
333  0.725021  0.389010  0.993716  0.096080  0.454585

[334 rows x 5 columns]

In [51]:
type(newdf)

pandas.core.frame.DataFrame

In [57]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.498634    0.483305    0.509478    0.482532    0.500446
std      0.278804    0.291029    0.295775    0.281958    0.293646
min      0.002933    0.001930    0.003942    0.000422    0.006972
25%      0.262459    0.239112    0.237681    0.262364    0.233883
50%      0.511813    0.446030    0.508915    0.465834    0.527721
75%      0.735416    0.743563    0.767876    0.711995    0.755275
max      0.996532    0.998854    0.998319    0.998140    0.999759

In [59]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [60]:
newdf[0][0] = "kavita"

In [130]:
newdf.head(2)

          0        1        2         3         4
0       1.4  5.00000  0.35638  0.889741  0.014918
1  0.526708  0.34395  0.14756  0.281319  0.984535

In [62]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [63]:
#convert dataframe into numpy

In [64]:
newdf.to_numpy()

array([['kavita', 0.03956389151490869, 0.3563797882566746,
        0.8897406310826426, 0.014917828628703056],
       [0.5267079047131015, 0.34394998774554, 0.14756013942979085,
        0.2813187770071267, 0.9845351825467812],
       [0.19804155369929632, 0.062251676582092186, 0.010508842708303323,
        0.03646703966009135, 0.41573022416525374],
       ...,
       [0.6214754204936082, 0.9780986231642583, 0.5686574623400068,
        0.023554529390693246, 0.7431152799299084],
       [0.12173056428781448, 0.9102479142990744, 0.9635862295882156,
        0.3847538974307265, 0.4378270503258872],
       [0.8523419167513273, 0.1989877500818341, 0.18587875730544334,
        0.019315913619647018, 0.6821047158304429]], dtype=object)

In [65]:
newdf[0][0]= 0.2324224242454

In [129]:
newdf.head(2)

          0        1        2         3         4
0       1.4  5.00000  0.35638  0.889741  0.014918
1  0.526708  0.34395  0.14756  0.281319  0.984535

In [69]:
# transpose row into column and vice versa

In [128]:
newdf.T.head()

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,1.4,0.526708,0.198042,0.187102,0.930176,0.09969,0.373834,0.26197,0.667805,0.871507,...,0.67602,0.276237,0.092839,0.484105,0.623013,0.914625,0.910579,0.621475,0.121731,0.852342
1,5.0,0.34395,0.062252,0.072202,0.149132,0.724276,0.297158,0.143519,0.168731,0.349742,...,0.24491,0.158483,0.826468,0.048998,0.04799,0.351961,0.96032,0.978099,0.910248,0.198988
2,0.35638,0.14756,0.010509,0.444231,0.321399,0.323081,0.766545,0.90425,0.515383,0.399624,...,0.684305,0.382512,0.719396,0.665305,0.314419,0.153964,0.480313,0.568657,0.963586,0.185879
3,0.889741,0.281319,0.036467,0.109172,0.982759,0.361248,0.039201,0.777579,0.62131,0.671134,...,0.239465,0.347825,0.873599,0.449116,0.301496,0.020305,0.38701,0.023555,0.384754,0.019316
4,0.014918,0.984535,0.41573,0.648923,0.729356,0.289585,0.926767,0.474276,0.904714,0.228307,...,0.874806,0.601357,0.046988,0.393934,0.932506,0.770128,0.091489,0.743115,0.437827,0.682105

In [71]:
# sorting axis =1 -- column, axis = 0---row

In [127]:
newdf.sort_index(axis=0, ascending=False).head(2)

            0         1         2         3         4
333  0.852342  0.198988  0.185879  0.019316  0.682105
332  0.121731  0.910248  0.963586  0.384754  0.437827

In [126]:
newdf.sort_index(axis=1, ascending=False).head(2)  # if ascending = true than nothing will happen

          4         3        2        1         0
0  0.014918  0.889741  0.35638  5.00000       1.4
1  0.984535  0.281319  0.14756  0.34395  0.526708

In [78]:
type(newdf[0])   #newdf[0]===show only one column of the dataframe

pandas.core.series.Series

In [ ]:
#copy function

In [100]:
newdf2 = newdf

In [111]:
newdf2.iloc[0,0]= 3.4

In [125]:
newdf.head(2)  # changes the value of previous dataframe also

          0        1        2         3         4
0       1.4  5.00000  0.35638  0.889741  0.014918
1  0.526708  0.34395  0.14756  0.281319  0.984535

In [105]:
newdf2 = newdf.copy()

In [113]:
newdf2.iloc[0,0]= 1.4

In [124]:
newdf.head(2)

          0        1        2         3         4
0       1.4  5.00000  0.35638  0.889741  0.014918
1  0.526708  0.34395  0.14756  0.281319  0.984535

In [123]:
newdf2.head(2)

          0        1        2         3         4
0       1.4  5.00000  0.35638  0.889741  0.014918
1  0.526708  0.34395  0.14756  0.281319  0.984535

In [116]:
#drop

In [122]:
newdf.drop(4, axis=1).head(2)

          0        1        2         3
0       1.4  5.00000  0.35638  0.889741
1  0.526708  0.34395  0.14756  0.281319

In [131]:
#indexing of row and column

In [132]:
newdf.iloc[[1,15],[1,3]]

           1         3
1   0.343950  0.281319
15  0.364752  0.545867

In [137]:
newdf.iloc[[1,2],:]  #print all columns

          0         1         2         3         4
1  0.526708  0.343950  0.147560  0.281319  0.984535
2  0.198042  0.062252  0.010509  0.036467  0.415730

In [138]:
newdf.iloc[330:,1:]

            1         2         3         4
330  0.960320  0.480313  0.387010  0.091489
331  0.978099  0.568657  0.023555  0.743115
332  0.910248  0.963586  0.384754  0.437827
333  0.198988  0.185879  0.019316  0.682105

In [139]:
#conditional

In [174]:
newdf.loc[(newdf[1]<0.01)]

            1         2         3
34   0.004705  0.564150  0.958973
90   0.006889  0.231759  0.752514
138  0.001930  0.404504  0.572563
240  0.006071  0.173979  0.302514

In [165]:
#inplace drop -- drop the row or column at that time ---remove permanently

In [170]:
newdf.drop(7,axis=0,inplace=True)

In [171]:
newdf.head(5)

          1         2         3
0  5.000000  0.356380  0.889741
1  0.343950  0.147560  0.281319
4  0.149132  0.321399  0.982759
5  0.724276  0.323081  0.361248
8  0.168731  0.515383  0.621310

In [175]:
#reset index after droping index

In [176]:
newdf.reset_index(drop=True,inplace=True)

In [177]:
newdf.head(4)

          1         2         3
0  5.000000  0.356380  0.889741
1  0.343950  0.147560  0.281319
2  0.149132  0.321399  0.982759
3  0.724276  0.323081  0.361248

In [178]:
newdf

            1         2         3
0    5.000000  0.356380  0.889741
1    0.343950  0.147560  0.281319
2    0.149132  0.321399  0.982759
3    0.724276  0.323081  0.361248
4    0.168731  0.515383  0.621310
..        ...       ...       ...
325  0.351961  0.153964  0.020305
326  0.960320  0.480313  0.387010
327  0.978099  0.568657  0.023555
328  0.910248  0.963586  0.384754
329  0.198988  0.185879  0.019316

[330 rows x 3 columns]

In [179]:
# changing value of columns and row

In [185]:
newdf.loc[:,[3]]= 55

In [188]:
newdf.head(3)

          1         2   3     0
0  5.000000  0.356380  55  None
1  0.343950  0.147560  55  None
2  0.149132  0.321399  55  None

In [190]:
newdf.drop(0,axis=1).head()

          1         2   3
0  5.000000  0.356380  55
1  0.343950  0.147560  55
2  0.149132  0.321399  55
3  0.724276  0.323081  55
4  0.168731  0.515383  55

# More function

In [203]:
df = pd.DataFrame({"Name":["Kavita","Anya","Mikasa"],
                   "Anime":["Real","Spy*family","AOT"],
                   "Role":["Hero","Kid","Army"]})

In [204]:
df.head()

     Name       Anime  Role
0  Kavita        Real  Hero
1    Anya  Spy*family   Kid
2  Mikasa         AOT  Army

In [205]:
df.shape

(3, 3)

In [206]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Anime   3 non-null      object
 2   Role    3 non-null      object
dtypes: object(3)
memory usage: 200.0+ bytes

In [209]:
df.notnull()

   Name  Anime  Role
0  True   True  True
1  True   True  True
2  True   True  True

In [210]:
df.isnull()

    Name  Anime   Role
0  False  False  False
1  False  False  False
2  False  False  False

# home work

In [214]:
df=pd.DataFrame(np.arange(0,9).reshape(3,3),index=['row1','row2','row3'],columns=['col1','col2','col3'])

In [215]:
df.head()

      col1  col2  col3
row1     0     1     2
row2     3     4     5
row3     6     7     8

In [216]:
df.describe()

       col1  col2  col3
count   3.0   3.0   3.0
mean    3.0   4.0   5.0
std     3.0   3.0   3.0
min     0.0   1.0   2.0
25%     1.5   2.5   3.5
50%     3.0   4.0   5.0
75%     4.5   5.5   6.5
max     6.0   7.0   8.0

In [218]:
df.mean()

col1    3.0
col2    4.0
col3    5.0
dtype: float64

In [219]:
df.corr()

      col1  col2  col3
col1   1.0   1.0   1.0
col2   1.0   1.0   1.0
col3   1.0   1.0   1.0

In [220]:
df.count()

col1    3
col2    3
col3    3
dtype: int64

In [221]:
df.max()

col1    6
col2    7
col3    8
dtype: int32

In [222]:
df.median()

col1    3.0
col2    4.0
col3    5.0
dtype: float64

In [223]:
df.std()

col1    3.0
col2    3.0
col3    3.0
dtype: float64